# แบบฝึกหัด 2

---

จากข้อมูล titanic.csv ให้ทำการวิเคราะห์ข้อมูลเบื้องต้นเกี่ยวกับคอลัมน์ cabin  
โดยแผนภาพด้านล่างนี้เป็นตำแหน่งของ cabin ตามตัวอักษรตัวแรกของรหัส cabin ที่บันทึกในชุดข้อมูล

![titanic-cabin](https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Olympic_%26_Titanic_cutaway_diagram.png/800px-Olympic_%26_Titanic_cutaway_diagram.png)

ให้นิสิตสร้างคอลัมน์เพิ่ม โดยคอลัมน์ที่เพิ่มมานี้ จะเก็บข้อมูลของตัวอักษรตัวแรกที่ปรากฏในคอลัมน์ Cabin เช่น  
- หากในคอลัมน์ Cabin เป็นค่า "C123" ในคอลัมน์ที่สร้างจะบันทึก "C"  
- หากในคอลัมน์ Cabin เป็นค่า "C23 C25 C27" ในคอลัมน์ที่สร้างจะบันทึก "C" 
- หากในคอลัมน์ Cabin เป็นค่า "B58 B60 C2" ในคอลัมน์ที่สร้างจะบันทึก "B" 
- หากในคอลัมน์ Cabin เป็นค่า "F2" ในคอลัมน์ที่สร้างจะบันทึก "F" 
- หากในคอลัมน์ Cabin เป็นค่า NaN ในคอลัมน์ที่สร้างจะบันทึก NaN

จากนั้นให้นิสิตเขียนโค้ดเพื่อตอบคำถามในแต่ละข้อ

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

นิสิตแสดงวิธีสร้างคอลัมน์

In [3]:
cabin_get = df.Cabin.tolist() # รับค่า Cabin มาเก็บใน cabin_get
cabin_list = [] 

for i in cabin_get:
    if i is not np.nan:
        cabin_list.append(i[0])
    else:
        cabin_list.append(i)
cabin = pd.DataFrame({'Cabin_2': cabin_list,}) # สร้างตารางใหม่ชื่อ cabin และเก็บค่าใน cabin_list ในคอลัมน์ Cabin_2

final_data = pd.concat([df, cabin], axis=1) # รวมตาราง df และ cabin ให้เป็นตารางเดียว
final_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,B
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,NaN

1. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารกี่คน และมีจำนวน NaN เท่าไหร่

In [4]:
count_nan = df['Cabin'].isnull().sum()
count_nan

687

2. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารที่รอดและเสียชีวิตอย่างละเท่าไหร่ cabin ใดมีจำนวนผู้เสียชีวิตมากที่สุด

In [5]:
c_df = pd.crosstab(final_data.Cabin_2, final_data.Survived, margins=False)
c_df.columns = ['died', 'alive']
display(c_df)

print("-------------------------------------------------------")

c_df = c_df[["alive", "died"]]
c_df_died = c_df[c_df['died'] == c_df['died'].max()]

print('ห้องโดยสาร {} มีผู้เสียชีวิตมากที่สุดรวมทั้งหมด {} คน\n'.format(c_df_died.index[0],c_df_died['died'][0]))

         died  alive
Cabin_2
A           8      7
B          12     35
C          24     35
D           8     25
E           8     24
F           5      8
G           2      2
T           1      0

-------------------------------------------------------
ห้องโดยสาร C มีผู้เสียชีวิตมากที่สุดรวมทั้งหมด 24 คน

3. cabin ใดมีค่า ratio ผู้รอดชีวิต / ผู้เสียชีวิต สูงสุด

In [77]:
c_df['ratio'] = c_df['alive'] / c_df['died']
display(c_df['ratio'])
c_df_ratio = c_df[c_df['ratio'] == c_df['ratio'].max()]
c_df_ratio
print("ห้องโดยสาร {} มีอัตราส่วนผู้รอดชีวิตต่อผู้เสียชีวิตสูงที่สุด {}".format(c_df_ratio.index[0], c_df['ratio'].max()))

Cabin_2
A    0.875000
B    2.916667
C    1.458333
D    3.125000
E    3.000000
F    1.600000
G    1.000000
T    0.000000
Name: ratio, dtype: float64

ห้องโดยสาร D มีอัตราส่วนผู้รอดชีวิตต่อผู้เสียชีวิตสูงที่สุด 3.125

3. cabin ใดมีค่าเฉลี่ยราคาตั๋ว (Fare) สูงสุด

In [ ]:
grp = final_data.filter(['Cabin_2', 'Fare']).groupby(['Cabin_2']).mean()
fare_max = grp.max()[0]
final_fare_data = grp[grp.Fare == fare_max]
print("ห้องผู้โดยสาร {} มีค่าเฉลี่ยราคาตั่ว {:.2f}".format(final_fare_data.index[0], final_fare_data.Fare[0]))

4. จงแสดงค่าเฉลี่ยราคาตั๋ว (Fare) ของผู้รอดชีวิต และผู้เสียชีวิต ในแต่ละ cabin หากเปรียบเทียบราคาเฉลี่ยของผู้ที่รอดและเสียชีวิตจะพบว่า

In [79]:
grp = final_data.filter(['Cabin_2', 'Survived', 'Fare']).groupby(['Cabin_2', 'Survived']).mean()
display(grp)
print('หากเปรียบเทียบราคาเฉลี่ยของผู้ที่รอดและเสียชีวิตจะพบว่า"ราคาตั๋วของผู้รอดชีวิตสูงกว่าราคาตั๋วของผู้เสียชีวิต"')

                        Fare
Cabin_2 Survived
A       0          35.496350
        1          44.341071
B       0          57.137500
        1         132.832026
C       0          99.972396
        1         100.274046
D       0          53.770825
        1          58.356176
E       0          43.715625
        1          46.797050
F       0          11.340000
        1          23.294787
G       0          10.462500
        1          16.700000
T       0          35.500000

หากเปรียบเทียบราคาเฉลี่ยของผู้ที่รอดและเสียชีวิตจะพบว่า"ราคาตั๋วของผู้รอดชีวิตสูงกว่าราคาตั๋วของผู้เสียชีวิต"

5. ในแต่ละ cabin มีจำนวนผู้โดยสารแยกตาม Pclass อย่างละกี่คน

In [8]:
sub = final_data.loc[:, ['Pclass']].value_counts()
for i in range(1,4):
    print("Pclass {} มี {}".format(i, sub[i]))

Pclass 1 มี 216
Pclass 2 มี 184
Pclass 3 มี 491